app/controllers/comments_controller.rb

INSERT INTO `comments` (`comment`, `created_at`, `commentable_type`, `commentable_id`, `updated_at`, `creator_id`) VALUES('sdaf', '2010-02-18 21:06:42', 'Proposal', 28, '2010-02-18 21:06:42', NULL)
---
  def create
    @commentable = find_commentable
    @comment = @commentable.comments.build(params[:comment])
    @comment.creator = current_user
    if @comment.save