app/controllers/file_attachments_controller.rb

  def load_file_attachment
    @file_attachment = FileAttachment.find(params[:id])
---
SELECT * FROM `file_attachments` WHERE (`file_attachments`.`id` = 4)

  def create
    if @file_attachment.save
---
INSERT INTO `file_attachments` (`image_file_content_type`, `image_file_updated_at`, `image_file_file_name`, `image_file_file_size`, `proposal_id`) VALUES(NULL, NULL, NULL, NULL, NULL)