app/controllers/inspirations_controller.rb

SELECT * FROM `inspirations` WHERE (`inspirations`.`id` = 13)
---
  def load_inspiration
    @inspiration = Inspiration.find(params[:id])

INSERT INTO `inspiration_images` (`image_file_content_type`, `image_file_updated_at`, `image_file_file_name`, `image_file_file_size`, `inspiration_id`) VALUES('image/png', '2010-02-25 20:12:00', 'rails.png', 6646, 1)
INSERT INTO `inspirations` (`image_file_content_type`, `image_file_updated_at`, `title`, `project_id`, `url`, `image_file_file_name`, `image_file_file_size`, `description`) VALUES(NULL, NULL, 'fhmfghm', 3, NULL, NULL, NULL, 'fhmgfhmk')
---
  def create
    if params[:inspiration_image].present?
      @inspiration.inspiration_images.build(:image_file => params[:inspiration_image])
    end
    if @inspiration.save

DELETE FROM `inspirations` WHERE `id` = 4
---
  def destroy
    @project = @inspiration.project
    if @inspiration.destroy