app/controllers/projects_controller.rb

SELECT * FROM `projects`
---
  def load_projects
    @projects = Project.all

SELECT * FROM `projects` WHERE (`projects`.`id` = 81)
---
  def load_project
    @project = Project.find(params[:id])

INSERT INTO `projects` (`slug`, `created_at`, `title`, `updated_at`, `creator_id`, `description`) VALUES(NULL, '2010-02-23 22:22:41', 'nbfm,f', '2010-02-23 22:22:41', NULL, 'fgh,mfghk,fgh,')
---
  def create
    @project.creator = current_user
    if @project.save

UPDATE `projects` SET `updated_at` = '2010-02-26 21:22:46', `description` = 'Adam wonders why this says test.' WHERE `id` = 1
---
  def update
    if @project.update_attributes(params[:project])

DELETE FROM `projects` WHERE `id` = 96
---
  def destroy
    if @project.destroy