app/controllers/proposals_controller.rb

SELECT * FROM `proposals` WHERE (`proposals`.`id` = 27)
---
  def load_proposal
    @proposal = Proposal.find(params[:id])

INSERT INTO `proposal_images` (`image_file_content_type`, `image_file_updated_at`, `image_file_file_name`, `image_file_file_size`, `proposal_id`) VALUES('image/jpeg', '2010-02-25 17:32:00', '5773_117344138759_580283759_2971779_7698229_s.jpg', 5694, 41)
INSERT INTO `proposals` (`image_file_content_type`, `product_id`, `project_id`, `image_file_file_name`, `image_file_file_size`, `creator_id`, `content`, `version_number`) VALUES(NULL, NULL, 1, NULL, NULL, 1, 'hjghkgfhk', NULL)
---
  def create
    if params[:proposal_image].present?
      @proposal.proposal_images.build(:image_file => params[:proposal_image])
    end
    if @proposal.save

UPDATE `proposals` SET `content` = 'this is starting to work' WHERE `id` = 27
---
  def update
    if @proposal.update_attributes(params[:proposal])

DELETE FROM `proposals` WHERE `id` = 24
---
  def destroy
    @project = @proposal.project
    if @proposal.destroy