app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def load_user
    @user = User.find params[:id]

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-02-16 17:49:06', '6cd5627a8d90f60b749b282cd0dfc51c060f674d8156db89812bef0a98c2a2f316cdb99d415b996715a5130f9e4722dbed83dd27127bf51525a4a1e198405789', '2010-02-16 17:49:06', 'rclements', 'viGoTHY7C6iW5WEINkBY', '2138123e2553ef3efee8932fd04f5e4be9fce74c3d303f8c89351d1324203b9d68aec67726a57b570e94750bce2d1a73ad07decfe2cb9da93755b9701c8555e9', 'rclements@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `projects` WHERE (`projects`.creator_id = 1)
SELECT * FROM `proposals` WHERE (`proposals`.creator_id = 1)
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'Proposal')
---
  def show
    @projects  = @user.projects.paginate(:page => params[:projects_page], :order => 'created_at DESC', :per_page => 5)
    @proposals = @user.proposals.paginate(:page => params[:proposals_page], :order => 'created_at DESC', :per_page => 5)
    @comments  = @user.comments.paginate(:page => params[:comments_page], :order => 'created_at DESC', :per_page => 5)

UPDATE `users` SET `updated_at` = '2010-02-16 17:52:44', `crypted_password` = '87907703cdf631d3888422b6717c9330cc81f05e5f91e702b4cf3655dd1f79ddf4e24c6fea33d4021f7b963f62691857d8196f3e74801e362f35e745d3c8a743', `password_salt` = 'VQC-09otozPe1jxqhVi8', `persistence_token` = 'bf50a1c83f9cd8cb36a15667b07dec37d7a3786da1c928d5161190bd1f406939e1152fbcbcc94f2a52db0e665fc037993b30eefdb3c5ecc044c9ed2ac2609504' WHERE `id` = 1
---
  def update
    @user = @current_user
    if @user.update_attributes(params[:user])