app/controllers/votes_controller.rb

  def find_votes_for_my_scope
    if params[:voteable_id]
      @votes = Vote.for_voteable(Voteable.find(params[:voteable_id])).descending
    elsif params[:user_id]
      @votes = Vote.for_voter(User.find(params[:user_id])).descending
---
SELECT * FROM `votes` WHERE ((voteable_id = 43 AND voteable_type = 'Proposal') AND (voter_id = 1 AND voter_type = 'User'))
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1